#ifdef __BUZZER_PLAY_CFG_H
extern "C"{
#endif
/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               buzzer.h
** Latest modified Date:    2017-5-15
** Latest Version:          
** Descriptions:            ·äÃùÆ÷Çý¶¯Í·ÎÄ¼þ
**
**--------------------------------------------------------------------------------------------------------
** Created by:              Hedan
** Created date:            2017-5-15
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/

/*********************************************************************************************************
** Function name:          PlayMusic
** Descriptions:            ·äÃùÆ÷Ãù½Ð
** input parameters:        uiKeyToneNum
** output parameters:       none
** Returned value:          0:  ³É¹¦
**                          -1: Ê§°Ü
*********************************************************************************************************/
extern void PlayMusic(unsigned int uiKeyToneNum,void (*delay)());

#ifdef __BUZZER_PLAY_CFG_H
}
#endif
