/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               buzzer.c
** Latest modified Date:    2017-5-15
** Latest Version:          
** Descriptions:            蜂鸣器驱动
**
**--------------------------------------------------------------------------------------------------------
** Created by:              Hedan
** Created date:            2017-5-15
** Version:                 
** Descriptions:            
**
*********************************************************************************************************/
#include<8051.h>
#include"buzzer.h"			//包含模块/驱动应用头文件
#include"buzzer_cfg.h"	//包含模块/驱动配置头文件


//unsigned char code SONG_TONE[]={262,294,330,394,392,440,494,523,600,700};//10个音阶的频率

unsigned int SONG_TONE[10]={19,17,15,13,12,11,10,9,8,7};	//10个音阶，如1DO（频率为262Hz的声音）：T/2=1÷262÷2=1900us

/*********************************************************************************************************
** Function name:           PlayMusic
** Descriptions:             通过延时循环控制蜂鸣器发出不同频率的声音
** input parameters:    uiKeyToneNum
** output parameters:       none
** Returned value:        0-------成功，
                                  -1------失败
*********************************************************************************************************/
void PlayMusic(unsigned int uiKeyToneNum,void (*delay)())
{
	unsigned int j,i;
	/*
	*通过延时循环控制蜂鸣器发出不同频率的声音，如1DO（频率为262Hz的声音）：T/2=1÷262÷2=1900us
	*/
	for(j=0;j<100;j++)		
	{
		__BUZZER_PIN=!__BUZZER_PIN;					
		for(i=0;i<SONG_TONE[uiKeyToneNum];i++)
			delay();
	
	}
}

