#ifndef __BUZZER_H_
#define __BUZZER_H_

/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               buzzer.h
** Latest modified Date:    2017-5-12
** Latest Version:          
** Descriptions:            蜂鸣器驱动头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-5-12
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#include"buzzer_cfg.h"

/*********************************************************************************************************
** Function name:           buzzerInit
** Descriptions:             蜂鸣器初始化
** input parameters:      none
** output parameters:       char
** Returned value:      0------初始化成功
                                 -1----初始化失败
*********************************************************************************************************/
extern char buzzerInit();


/*********************************************************************************************************
** Function name:           buzzerSpecialHzTweet
** Descriptions:            蜂鸣器以特定的频率鸣叫
** input parameters:      uiSpecialHzLevel：特定的鸣叫等级
** output parameters:       none
** Returned value:     
*********************************************************************************************************/
extern void buzzerSpecialHzTweet(unsigned char ucSpecialHzLevel);

#endif
