/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               buzzer.c
** Latest modified Date:    2017-5-12
** Latest Version:          
** Descriptions:            蜂鸣器驱动实现文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-5-12
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

#include"buzzer.h"


/*********************************************************************************************************
** Function name:           buzzerInit
** Descriptions:             蜂鸣器初始化
** input parameters:      none
** output parameters:       char
** Returned value:      0------初始化成功
                                 -1----初始化失败
*********************************************************************************************************/
char buzzerInit()
{
	return 0;
}


/*********************************************************************************************************
** Function name:           buzzerSpecialHzTweet
** Descriptions:            蜂鸣器以特定的频率鸣叫
** input parameters:      uiSpecialHzLevel：特定的鸣叫等级
** output parameters:       none
** Returned value:     
*****************************************************void****************************************************/
void buzzerSpecialHzTweet(unsigned char ucSpecialHzLevel)
{
	unsigned int i;
	if (ucSpecialHzLevel==0)
		return;
	
	for(i=0;i<15000/(ucSpecialHzLevel*10);i++){
			BUZZER_PIN=!BUZZER_PIN;
			}
			
	
}
