#ifndef __KEYBOARD_SCAN_H
#define __KEYBOARD_SCAN_H
/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               keyboard_scan.h
** Latest modified Date:    2017-5-9
** Latest Version:          
** Descriptions:            键盘驱动头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-5-9
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/

/*********************************************************************************************************
** Function name:           keyboardInit
** Descriptions:             键盘初始化
** input parameters:      none
** output parameters:       char
** Returned value:      0------初始化成功
                                 -1----初始化失败
*********************************************************************************************************/

extern char keyboardInit();

/*********************************************************************************************************
** Function name:           allKeyCheck
** Descriptions:             检测有按键是否被按下,没有消抖
** input parameters:      none
** output parameters:       char
** Returned value:        ‘key’-------有按下key键，
                                  -1------无按下
*********************************************************************************************************/
extern char allKeyCheck();

/*********************************************************************************************************
** Function name:           isExsitPushKey
** Descriptions:             是否存在按下的按键，已经消抖
** input parameters:      none
** output parameters:       none
** Returned value:        ‘key’-------有按下key键，
                                  -1------无按下
*********************************************************************************************************/
extern char isExsitPushKey();

/*********************************************************************************************************
** Function name:           isExsitRealaseKey
** Descriptions:             是否存在按键已经释放，已经消抖
** input parameters:      none
** output parameters:       none
** Returned value:         0-------有释放
                                  -1------无释放
*********************************************************************************************************/
extern char isExsitRealaseKey();


/*********************************************************************************************************
** Function name:           throwError
** Descriptions:             消抖
** input parameters:      none
** output parameters:       none
** Returned value:        
*********************************************************************************************************/

void throwError();
#endif

