/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               led_disp_cfg.h
** Latest modified Date:    2017-5-2
** Latest Version:          
** Descriptions:           LED数码管动态扫描显示驱动电路配置文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-5-2
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#include<8051.h>
#ifndef __LED_DISPLAY_CFG_H    
#define  __LED_DISPLAY_CFG_H         //为了防止其他重复引用这个头文件,工程中经常用
/*********************************************************************************************
引脚配置
************************************************************************************************/
#define _LED_DIG1_ON()   P1_2=0   //点亮数码管1
#define _LED_DIG1_OFF()  P1_2=1   //熄灭数码管1
#define _LED_DIG2_ON()   P1_3=0   //点亮数码管2
#define _LED_DIG2_OFF()  P1_3=1   //熄灭数码管2
#define _LED_DIG3_ON()   P1_4=0   //点亮数码管3
#define _LED_DIG3_OFF()  P1_4=1   //熄灭数码管3
#define _LED_DIG4_ON()   P1_5=0   //点亮数码管4
#define _LED_DIG4_OFF()  P1_5=1   //熄灭数码管4
#define _LED_DIG5_ON()   P1_6=0   //点亮数码管5
#define _LED_DIG5_OFF()  P1_6=1   //熄灭数码管5
#define _LED_DIG6_ON()   P1_7=0   //点亮数码管6
#define _LED_DIG6_OFF()  P1_7=1   //熄灭数码管6

#define _LED_SEG(data)     P2=data    //显示数据

#endif                                         //__LED_DISPLAY_CFG_H

