/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               speak.c
** Latest modified Date:    2017-6-18
** Latest Version:          
** Descriptions:            语音驱动实现文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-6-18
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/
#include<8051.h>

#include"speak.h"
#include"time.h"
/*********************************************************************************************************
** Function name:           speak
** Descriptions:             语音播报
** input parameters:        ucz:对应的语音
** output parameters:       none
** Returned value:      none
*********************************************************************************************************/
void speak(unsigned char ucz)
{
	SPEAK_RESET=1; //复位脚为高电平//
 delay100us(2); //持续 200us//
 SPEAK_RESET=0; //然后复位脚置零//
 delay100us(2);
 while(ucz>0) //若 Z 等于 0 则不工作，若大于 0 则继续自减//
 {
 SPEAK_DATA=1; //data 脚位为高电平//
delay100us(1); //持续 100us//
 SPEAK_DATA=0; //然后置零//
delay100us(1); //持续 100us 这三句的意思就是发从一个 100us 的脉冲（高低各 100us）//
ucz--; //z 自减完成后开始播放对应的语音（因为 z 是几就播放第几段）//
 }
 while(SPEAK_BUSY==0)
	 ;
}


