#ifndef __BUZZE_H_
#define __BUZZE_H_
#include<8051.h>
/****************************************Copyright (c)****************************************************
**
**--------------File Info---------------------------------------------------------------------------------
** File name:               buzze.h
** Latest modified Date:    2017-5-31
** Latest Version:          
** Descriptions:            蜂鸣器头文件
**
**--------------------------------------------------------------------------------------------------------
** Created by:              jsj
** Created date:            2017-5-31
** Version:                 
** Descriptions:            
**
**--------------------------------------------------------------------------------------------------------
*--------------------------------------------------------------------------------------------------------
** Modified by:
** Modified date:
** Version:
** Descriptions:
**
*********************************************************************************************************/


/*********************************************************************************************************
** Function name:           buzzeInit
** Descriptions:             蜂鸣器初始化
** input parameters:      none
** output parameters:       char
** Returned value:      0------初始化成功
                                 -1----初始化失败
*********************************************************************************************************/
char buzzeInit();


/*********************************************************************************************************
** Function name:           buzzeRun
** Descriptions:             蜂鸣器鸣叫
** input parameters:      uiHz:特定频率,ulTime;特定时间，以100us为单位
** output parameters:       none
** Returned value:      
                                 
*********************************************************************************************************/
void buzzeRun(unsigned int uiHz,unsigned long ulTime );

/*********************************************************************************************************
** Function name:           time1Interrupt
** Descriptions:             定时器1中断函数
** input parameters:      none
** output parameters:       none
** Returned value:      
*********************************************************************************************************/
void time1Interrupt()  interrupt 3;

/*********************************************************************************************************
** Function name:           allEnableOpen
** Descriptions:             总使能中断进行使能
** input parameters:      none
** output parameters:       char
** Returned value:      0------使能成功
                                 -1----使能失败
*********************************************************************************************************/
char allEnableOpen();

/*********************************************************************************************************
** Function name:           allEnableClose
** Descriptions:             总使能中断进行禁止
** input parameters:      none
** output parameters:       char
** Returned value:      0------禁止成功
                                 -1----禁止失败
*********************************************************************************************************/
char allEnableClose();


/*********************************************************************************************************
** Function name:           time0Init
** Descriptions:             定时器0初始化
** input parameters:      none
** output parameters:       char
** Returned value:      0------初始化成功
                                 -1----初始化失败
*********************************************************************************************************/
char time0Init();

/*********************************************************************************************************
** Function name:           delay100us
** Descriptions:             延时函数，延时单位为100us
** input parameters:      延时时间
** output parameters:       none
** Returned value:      
*********************************************************************************************************/

void delay100us(unsigned long uiTime);
/*********************************************************************************************************
** Function name:           time0Interrupt
** Descriptions:             定时器0中断函数
** input parameters:      none
** output parameters:       none
** Returned value:      
*********************************************************************************************************/
void time0Interrupt(void)  interrupt 1;

#endif

